Ran Plan for project: `platform` dir: `2.platform` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
- destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # helm_release.infisical must be replaced
-/+ resource "helm_release" "infisical" {
      ~ id                         = "infisical" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version    = "1.0.1"
              - chart          = "infisical-standalone"
              - first_deployed = 1765280595
              - last_deployed  = 1765280595
              - name           = "infisical"
              - namespace      = "security"
              - notes          = <<-EOT
                    CHART NAME: redis
                    CHART VERSION: 18.14.1
                    APP VERSION: 7.2.4
                    
                    ** Please be patient while the chart is being deployed **
                    
                    Redis&reg; can be accessed via port 6379 on the following DNS name from within your cluster:
                    
                        redis-master.security.svc.cluster.local
                    
                    
                    
                    To connect to your Redis&reg; server:
                    
                    1. Run a Redis&reg; pod that you can use as a client:
                    
                       kubectl run --namespace security redis-client --restart='Never'  --image mirror.gcr.io/bitnamilegacy/redis:7.2.4-debian-11-r18 --command -- sleep infinity
                    
                       Use the following command to attach to the pod:
                    
                       kubectl exec --tty -i redis-client \
                       --namespace security -- bash
                    
                    2. Connect using the Redis&reg; CLI:
                       redis-cli -h redis-master
                    
                    To connect to your database from outside the cluster execute the following commands:
                    
                        kubectl port-forward --namespace security svc/redis-master 6379:6379 &
                        redis-cli -h 127.0.0.1 -p 6379
                    
                    WARNING: There are "resources" sections in the chart not set. Using "resourcesPreset" is not recommended for production. For production installations, please set the following values according to your workload needs:
                      - master.resources
                      - replica.resources
                    +info https://kubernetes.io/docs/concepts/configuration/manage-resources-containers/
                    
                    ##
                    
                    -- Infisical Helm Chart --
                    
                    ██╗███╗   ██╗███████╗██╗███████╗██╗ ██████╗ █████╗ ██╗     
                    ██║████╗  ██║██╔════╝██║██╔════╝██║██╔════╝██╔══██╗██║     
                    ██║██╔██╗ ██║█████╗  ██║███████╗██║██║     ███████║██║     
                    ██║██║╚██╗██║██╔══╝  ██║╚════██║██║██║     ██╔══██║██║     
                    ██║██║ ╚████║██║     ██║███████║██║╚██████╗██║  ██║███████╗
                    ╚═╝╚═╝  ╚═══╝╚═╝     ╚═╝╚══════╝╚═╝ ╚═════╝╚═╝  ╚═╝╚══════╝
                    infisical-standalone (1.7.2)
                    
                    
                    ╭―― Thank you for installing Infisical! 👋  ―――――――――――――――――――――――――――――――――――――――――――――――――――――――――――┤
                    │
                    │   Infisical / All-in-one open-source SecretOps solution to manage your secrets across your infra! 🔒🔑
                    │
                    │   Visit < https://infisical.com/docs/self-hosting/overview > for further documentation about self-hosting!
                    │
                    │   Current installation (infisical) :
                    │   • infisical          : true
                    |   • nginx              : false
                    |   • Postgres DB        : false
                    |   • Redis              : true
                    │
                    ╰―――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――┤
                    
                    ――― Here's a list of helpful commands to get you started 📝  ―――――――――――――――――――――――――――――――――――――――――┤
                    
                    → Get all the Infisical resources (excluding secrets/pvcs)
                    $ kubectl get all -n security
                     
                    → Get your release status
                    $ helm status -n security infisical
                    
                    → Get your release resources
                    $ helm get all -n security infisical
                    
                    → Uninstall your release
                    $ helm uninstall -n security infisical
                     
                    ――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――┤
                    
                    ##
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - controller    = {
                          - replicas = 1
                        }
                      - image         = {
                          - repository = "infisical/infisical"
                          - tag        = "v0.92.0-postgres"
                        }
                      - infisical     = {
                          - image = {
                              - repository = "infisical/infisical"
                              - tag        = "v0.92.0-postgres"
                            }
                        }
                      - ingress       = {
                          - enabled = false
                          - nginx   = {
                              - enabled = false
                            }
                        }
                      - kubeSecretRef = "infisical-secrets"
                      - postgresql    = {
                          - enabled = false
                        }
                      - redis         = {
                          - architecture = "standalone"
                          - auth         = {
                              - enabled = false
                            }
                          - enabled      = true
                        }
                      - resources     = {
                          - limits   = {
                              - cpu    = "1000m"
                              - memory = "1Gi"
                            }
                          - requests = {
                              - cpu    = "500m"
                              - memory = "512Mi"
                            }
                        }
                    }
                )
              - version        = "1.7.2"
            },
        ] -> (known after apply)
        name                       = "infisical"
      ~ namespace                  = "security" -> "platform" # forces replacement
        # (26 unchanged attributes hidden)
    }

  # helm_release.kubernetes_dashboard must be replaced
-/+ resource "helm_release" "kubernetes_dashboard" {
      ~ id                         = "kubernetes-dashboard" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version    = ""
              - chart          = "kubernetes-dashboard"
              - first_deployed = 1765257350
              - last_deployed  = 1765257350
              - name           = "kubernetes-dashboard"
              - namespace      = "kubernetes-dashboard"
              - notes          = <<-EOT
                    *************************************************************************************************
                    *** PLEASE BE PATIENT: Kubernetes Dashboard may need a few minutes to get up and become ready ***
                    *************************************************************************************************
                    
                    Congratulations! You have just installed Kubernetes Dashboard in your cluster.
                    
                    To access Dashboard run:
                      kubectl -n kubernetes-dashboard port-forward svc/kubernetes-dashboard-kong-proxy 8443:443
                    
                    NOTE: In case port-forward command does not work, make sure that kong service name is correct.
                          Check the services in Kubernetes Dashboard namespace using:
                            kubectl -n kubernetes-dashboard get svc
                    
                    Dashboard will be available at:
                      https://localhost:8443
                    
                    
                    
                    To connect to Kong, please execute the following commands:
                    export PROXY_IP=${HOST}:${PORT}
                    curl $PROXY_IP
                    
                    Once installed, please follow along the getting started guide to start using
                    Kong: https://docs.konghq.com/kubernetes-ingress-controller/latest/guides/getting-started/
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - api  = {
                          - containers = {
                              - resources = {
                                  - limits   = {
                                      - cpu    = "250m"
                                      - memory = "256Mi"
                                    }
                                  - requests = {
                                      - cpu    = "100m"
                                      - memory = "128Mi"
                                    }
                                }
                            }
                        }
                      - app  = {
                          - ingress = {
                              - enabled = false
                            }
                        }
                      - kong = {
                          - proxy   = {
                              - http = {
                                  - enabled     = true
                                  - servicePort = 8443
                                }
                            }
                          - service = {
                              - type = "ClusterIP"
                            }
                        }
                      - web  = {
                          - containers = {
                              - resources = {
                                  - limits   = {
                                      - cpu    = "150m"
                                      - memory = "128Mi"
                                    }
                                  - requests = {
                                      - cpu    = "50m"
                                      - memory = "64Mi"
                                    }
                                }
                            }
                        }
                    }
                )
              - version        = "7.10.0"
            },
        ] -> (known after apply)
        name                       = "kubernetes-dashboard"
      ~ namespace                  = "kubernetes-dashboard" -> "platform" # forces replacement
        # (26 unchanged attributes hidden)
    }

  # helm_release.postgresql must be replaced
-/+ resource "helm_release" "postgresql" {
      ~ id                         = "postgresql" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version    = "16.3.0"
              - chart          = "postgresql"
              - first_deployed = 1765257349
              - last_deployed  = 1765257349
              - name           = "postgresql"
              - namespace      = "security"
              - notes          = <<-EOT
                    CHART NAME: postgresql
                    CHART VERSION: 15.5.0
                    APP VERSION: 16.3.0
                    
                    ** Please be patient while the chart is being deployed **
                    
                    PostgreSQL can be accessed via port 5432 on the following DNS names from within your cluster:
                    
                        postgresql.security.svc.cluster.local - Read/Write connection
                    
                    To get the password for "postgres" run:
                    
                        export POSTGRES_ADMIN_PASSWORD=$(kubectl get secret --namespace security postgresql -o jsonpath="{.data.postgres-password}" | base64 -d)
                    
                    To get the password for "infisical" run:
                    
                        export POSTGRES_PASSWORD=$(kubectl get secret --namespace security postgresql -o jsonpath="{.data.password}" | base64 -d)
                    
                    To connect to your database run the following command:
                    
                        kubectl run postgresql-client --rm --tty -i --restart='Never' --namespace security --image docker.io/bitnami/postgresql:latest --env="PGPASSWORD=$POSTGRES_PASSWORD" \
                          --command -- psql --host postgresql -U infisical -d infisical -p 5432
                    
                        > NOTE: If you access the container using bash, make sure that you execute "/opt/bitnami/scripts/postgresql/entrypoint.sh /bin/bash" in order to avoid the error "psql: local user with ID 1001} does not exist"
                    
                    To connect to your database from outside the cluster execute the following commands:
                    
                        kubectl port-forward --namespace security svc/postgresql 5432:5432 &
                        PGPASSWORD="$POSTGRES_PASSWORD" psql --host 127.0.0.1 -U infisical -d infisical -p 5432
                    
                    WARNING: The configured password will be ignored on new installation in case when previous PostgreSQL release was deleted through the helm command. In that case, old PVC will have an old password, and setting it through helm won't take effect. Deleting persistent volumes (PVs) will solve the issue.
                    WARNING: Rolling tag detected (bitnami/postgresql:latest), please note that it is strongly recommended to avoid using rolling tags in a production environment.
                    +info https://docs.vmware.com/en/VMware-Tanzu-Application-Catalog/services/tutorials/GUID-understand-rolling-tags-containers-index.html
                    
                    ⚠ SECURITY WARNING: Original containers have been substituted. This Helm chart was designed, tested, and validated on multiple platforms using a specific set of Bitnami and Tanzu Application Catalog containers. Substituting other containers is likely to cause degraded security and performance, broken chart features, and missing environment variables.
                    
                    Substituted images detected:
                      - docker.io/bitnami/postgresql:latest
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - auth         = {
                          - database = "infisical"
                          - password = "Ld63FK25alvAwewa18YS85JMPwxzkt"
                          - username = "infisical"
                        }
                      - image        = {
                          - tag = "latest"
                        }
                      - primary      = {
                          - persistence = {
                              - enabled      = true
                              - size         = "8Gi"
                              - storageClass = "local-path-retain"
                            }
                          - resources   = {
                              - limits   = {
                                  - cpu    = "500m"
                                  - memory = "1Gi"
                                }
                              - requests = {
                                  - cpu    = "250m"
                                  - memory = "512Mi"
                                }
                            }
                        }
                      - readReplicas = {
                          - enabled = false
                        }
                    }
                )
              - version        = "15.5.0"
            },
        ] -> (known after apply)
        name                       = "postgresql"
      ~ namespace                  = "security" -> "platform" # forces replacement
        # (26 unchanged attributes hidden)
    }

  # kubernetes_cluster_role_binding.dashboard_admin will be updated in-place
~ resource "kubernetes_cluster_role_binding" "dashboard_admin" {
        id = "dashboard-admin"

      ~ subject {
            name      = "dashboard-admin"
          ~ namespace = "kubernetes-dashboard" -> "platform"
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # kubernetes_ingress_v1.dashboard must be replaced
-/+ resource "kubernetes_ingress_v1" "dashboard" {
      ~ id     = "kubernetes-dashboard/kubernetes-dashboard" -> (known after apply)
      ~ status = [
          - {
              - load_balancer = [
                  - {
                      - ingress = [
                          - {
                              - hostname = ""
                              - ip       = "103.214.23.41"
                            },
                        ]
                    },
                ]
            },
        ] -> (known after apply)

      ~ metadata {
          ~ generation       = 1 -> (known after apply)
          - labels           = {} -> null
            name             = "kubernetes-dashboard"
          ~ namespace        = "kubernetes-dashboard" -> "platform" # forces replacement
          ~ resource_version = "207527" -> (known after apply)
          ~ uid              = "4202474f-de39-425d-8f78-fdfbfe999e34" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # kubernetes_ingress_v1.infisical must be replaced
-/+ resource "kubernetes_ingress_v1" "infisical" {
      ~ id     = "security/infisical-ingress" -> (known after apply)
      ~ status = [
          - {
              - load_balancer = [
                  - {
                      - ingress = [
                          - {
                              - hostname = ""
                              - ip       = "103.214.23.41"
                            },
                        ]
                    },
                ]
            },
        ] -> (known after apply)

      ~ metadata {
          ~ generation       = 1 -> (known after apply)
          - labels           = {} -> null
            name             = "infisical-ingress"
          ~ namespace        = "security" -> "platform" # forces replacement
          ~ resource_version = "245893" -> (known after apply)
          ~ uid              = "1451d283-ee1a-4669-91b6-db84b3b49d8a" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # kubernetes_namespace.dashboard will be destroyed
  # (because kubernetes_namespace.dashboard is not in configuration)
- resource "kubernetes_namespace" "dashboard" {
      - id                               = "kubernetes-dashboard" -> null
      - wait_for_default_service_account = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "kubernetes-dashboard" -> null
          - resource_version = "207018" -> null
          - uid              = "d83bfb9c-336e-4e6a-a758-e86e9125f1f8" -> null
        }
    }

  # kubernetes_namespace.kubero will be updated in-place
~ resource "kubernetes_namespace" "kubero" {
        id                               = "kubero"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ labels           = {
              + "layer" = "L2"
            }
            name             = "kubero"
            # (4 unchanged attributes hidden)
        }
    }

  # kubernetes_namespace.kubero_operator_system will be updated in-place
~ resource "kubernetes_namespace" "kubero_operator_system" {
        id                               = "kubero-operator-system"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ labels           = {
              + "layer"         = "L2"
                # (1 unchanged element hidden)
            }
            name             = "kubero-operator-system"
            # (4 unchanged attributes hidden)
        }
    }

  # kubernetes_namespace.platform must be replaced
  # (moved from kubernetes_namespace.security)
-/+ resource "kubernetes_namespace" "platform" {
      ~ id                               = "security" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 0 -> (known after apply)
          ~ labels           = {
              + "layer" = "L2"
            }
          ~ name             = "security" -> "platform" # forces replacement
          ~ resource_version = "207019" -> (known after apply)
          ~ uid              = "e9489a53-0619-4caa-ae8c-5e2e9a1f1b25" -> (known after apply)
        }
    }

  # kubernetes_secret.dashboard_admin_token must be replaced
-/+ resource "kubernetes_secret" "dashboard_admin_token" {
      ~ data                           = (sensitive value)
      ~ id                             = "kubernetes-dashboard/dashboard-admin-token" -> (known after apply)
      - immutable                      = false -> null
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ generation       = 0 -> (known after apply)
          - labels           = {} -> null
            name             = "dashboard-admin-token"
          ~ namespace        = "kubernetes-dashboard" -> "platform" # forces replacement
          ~ resource_version = "207535" -> (known after apply)
          ~ uid              = "55c66647-c892-4960-99d7-b726e04f9666" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # kubernetes_secret.infisical_secrets must be replaced
-/+ resource "kubernetes_secret" "infisical_secrets" {
      ~ data                           = (sensitive value)
      ~ id                             = "security/infisical-secrets" -> (known after apply)
      - immutable                      = false -> null
        # (2 unchanged attributes hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {} -> null
            name             = "infisical-secrets"
          ~ namespace        = "security" -> "platform" # forces replacement
          ~ resource_version = "255215" -> (known after apply)
          ~ uid              = "7024bdb6-c7aa-4702-be91-d053172cb421" -> (known after apply)
        }
    }

  # kubernetes_service_account.dashboard must be replaced
-/+ resource "kubernetes_service_account" "dashboard" {
      + default_secret_name             = (known after apply)
      ~ id                              = "kubernetes-dashboard/kubernetes-dashboard" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {} -> null
            name             = "kubernetes-dashboard"
          ~ namespace        = "kubernetes-dashboard" -> "platform" # forces replacement
          ~ resource_version = "207027" -> (known after apply)
          ~ uid              = "220c43d8-a9f8-4e95-b66a-84b60214b377" -> (known after apply)
        }
    }

  # kubernetes_service_account.dashboard_admin must be replaced
-/+ resource "kubernetes_service_account" "dashboard_admin" {
      + default_secret_name             = (known after apply)
      ~ id                              = "kubernetes-dashboard/dashboard-admin" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {} -> null
            name             = "dashboard-admin"
          ~ namespace        = "kubernetes-dashboard" -> "platform" # forces replacement
          ~ resource_version = "207525" -> (known after apply)
          ~ uid              = "b6261697-7eb0-4356-a5ea-2b679354c73c" -> (known after apply)
        }
    }

Plan: 10 to add, 3 to change, 11 to destroy.

Changes to Outputs:
~ infisical_access_via_port_forward = "kubectl -n security port-forward svc/infisical-backend 8080:8080" -> "kubectl -n platform port-forward svc/infisical-backend 8080:8080"
~ infisical_endpoint                = "infisical-backend.security.svc.cluster.local:8080" -> "infisical-backend.platform.svc.cluster.local:8080"
~ postgresql_endpoint               = "postgresql.security.svc.cluster.local:5432" -> "postgresql.platform.svc.cluster.local:5432"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p platform`
* :put_litter_in_its_place: To **delete** this plan click [here](https://i-atlantis.truealpha.club/lock?id=wangzitian0%252Finfra%252F2.platform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p platform`
</details>
Plan: 10 to add, 3 to change, 11 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`